In [1]:
print("hello eorld")

hello eorld

In [ ]:
import pandas as pd

In [ ]:
df=pd.DataFrame({
    "Name":["Aman","Saurav","Karan","subham","Abhishek",None,"Sameer"],
    "Age":[22,54,None,54,54,59,25],
    "Marks":[85,None,88,89,89,69,None],
    "Subject":["Math","phy","chem","chem","Math","phy","chem"]
})
df

       Name   Age  Marks Subject
0      Aman  22.0   85.0    Math
1    Saurav  54.0    NaN     phy
2     Karan   NaN   88.0    chem
3    subham  54.0   89.0    chem
4  Abhishek  54.0   89.0    Math
5      None  59.0   69.0     phy
6    Sameer  25.0    NaN    chem

In [ ]:
print(df.shape)

(7, 4)

In [ ]:
print(df.dtypes)

Name        object
Age        float64
Marks      float64
Subject     object
dtype: object

In [ ]:
print(df[["Name","Marks"]])

In [ ]:
print(df[["Marks"]]>80)

In [ ]:
filtered_students = df[(df["Age"] > 22) & (df["Marks"] > 80)]
filtered_students

In [ ]:
df["Subject"].value_counts()

In [ ]:
df_sort = df.sort_values(by="Marks", ascending=False)
df_sort

In [ ]:
top_2 = df.nlargest(2, "Marks")
top_2

In [ ]:
lowest = df.nsmallest(1, "Marks")
lowest

In [ ]:
df.isna().sum()

In [ ]:
df[df["Marks"].isna()]

In [ ]:
cleaned_data=df.dropna()
cleaned_data

In [ ]:
print(df.shape)

In [ ]:
print(cleaned_data.shape)

In [ ]:
#EX5.

#1.None in numeric column becomes nan which is float type.
#2.It will alter the original data which may lead to data inconsistency
#3.Handel the missing values